In [1]:
import sqlite3

In [2]:
# connecting to the Database in Python
connection = sqlite3.connect('books.db')

## Database schema
The database consists of three tables - authors, authors_ISBN and titles

The authors table stores information about all authors in three columns
<li> id (The author's unique id) </li>
<li> first_name </li>
<li> last_name </li>

The authors_ISBN table stores information about authors publishing the book titles in the two columns
<li> author_id </li>
<li> book_isbn </li>

The titles table stores all the books in four columns
<li> isbn </li>
<li> title </li>
<li> edition </li>
<li> copyright_year </li>

In [3]:
# let's create tables now
driver = connection.cursor()
command = "CREATE TABLE IF NOT EXISTS authors(id INTEGER PRIMARY KEY, first_name text, last_name text)"
driver.execute(command)
connection.commit()

In [4]:
# let's add rows to our tables
import pandas as pd
authors = pd.read_excel('/Users/sambriddhimainali/UMSL/Python For Scientific Computing and Data Science/book_database_info.xlsx',\
                       sheet_name="authors")

In [5]:
authors.head()

   id first_name last_name
0   1       Paul    Deitel
1   2     Harvey    Deitel
2   3      Abbey    Deitel
3   4        Dan     Quirk
4   5  Alexander      Wald

In [6]:
authors.to_sql('authors', connection, if_exists='replace', index=False)
connection.commit()
# driver.close()

## Extracting data from the table using several keywords

In [7]:
view_authors = pd.read_sql("Select * from authors", connection)
view_authors

   id first_name last_name
0   1       Paul    Deitel
1   2     Harvey    Deitel
2   3      Abbey    Deitel
3   4        Dan     Quirk
4   5  Alexander      Wald

In [8]:
pd.read_sql("Select first_name, last_name from authors", connection)

  first_name last_name
0       Paul    Deitel
1     Harvey    Deitel
2      Abbey    Deitel
3        Dan     Quirk
4  Alexander      Wald

In [9]:
pd.read_sql("Select first_name, last_name from authors Where last_name == 'Deitel'", connection)

  first_name last_name
0       Paul    Deitel
1     Harvey    Deitel
2      Abbey    Deitel

In [10]:
pd.read_sql("Select first_name, last_name from authors WHERE last_name LIKE 'D%'", connection)

  first_name last_name
0       Paul    Deitel
1     Harvey    Deitel
2      Abbey    Deitel

In [11]:
pd.read_sql("Select first_name, last_name from authors WHERE first_name LIKE '%y'", connection)

  first_name last_name
0     Harvey    Deitel
1      Abbey    Deitel

In [12]:
pd.read_sql("Select first_name, last_name from authors ORDER BY first_name ASC", connection)

  first_name last_name
0      Abbey    Deitel
1  Alexander      Wald
2        Dan     Quirk
3     Harvey    Deitel
4       Paul    Deitel

In [13]:
pd.read_sql("Select first_name, last_name from authors ORDER BY first_name DESC", connection)

  first_name last_name
0       Paul    Deitel
1     Harvey    Deitel
2        Dan     Quirk
3  Alexander      Wald
4      Abbey    Deitel

In [14]:
pd.read_sql("Select * from authors ORDER BY last_name, first_name", connection)

   id first_name last_name
0   3      Abbey    Deitel
1   2     Harvey    Deitel
2   1       Paul    Deitel
3   4        Dan     Quirk
4   5  Alexander      Wald

In [15]:
pd.read_sql("Select * from authors ORDER BY last_name DESC, first_name ASC", connection)

   id first_name last_name
0   5  Alexander      Wald
1   4        Dan     Quirk
2   3      Abbey    Deitel
3   2     Harvey    Deitel
4   1       Paul    Deitel

In [16]:
pd.read_sql("Select * from authors WHERE last_name LIKE 'D%' ORDER BY first_name ASC", connection)

   id first_name last_name
0   3      Abbey    Deitel
1   2     Harvey    Deitel
2   1       Paul    Deitel

## Inserting a new row

In [17]:
command = "INSERT INTO authors VALUES (6, 'Suzanne', 'Red')"
driver.execute(command)
connection.commit()
pd.read_sql("Select * from authors", connection)

   id first_name last_name
0   1       Paul    Deitel
1   2     Harvey    Deitel
2   3      Abbey    Deitel
3   4        Dan     Quirk
4   5  Alexander      Wald
5   6    Suzanne       Red

## Updating the existing row

In [18]:
command = "UPDATE authors SET last_name = 'Black' WHERE first_name = 'Suzanne'"
driver.execute(command)
connection.commit()
pd.read_sql("Select * from authors", connection)

   id first_name last_name
0   1       Paul    Deitel
1   2     Harvey    Deitel
2   3      Abbey    Deitel
3   4        Dan     Quirk
4   5  Alexander      Wald
5   6    Suzanne     Black

In [19]:
command = "DELETE from authors WHERE id = 6"
driver.execute(command)
connection.commit()
pd.read_sql("Select * from authors", connection)

   id first_name last_name
0   1       Paul    Deitel
1   2     Harvey    Deitel
2   3      Abbey    Deitel
3   4        Dan     Quirk
4   5  Alexander      Wald

In [20]:
# Closing the database
# connection.close()

# In class activity create tables titles and author_ISBN tables and use all the commands as shown above to view data from the tables, to insert new rows, to update an existing row, and to delete an existing row in both tables - [40 points]

# Merging Data from multiple tables: inner join

In [22]:
pd.read_sql("""SELECT first_name, last_name 
                FROM authors
                INNER JOIN authors_ISBN
                ON authors.id == authors_ISBN.author_id
                ORDER BY last_name, first_name""", connection)

  first_name last_name
0     Harvey    Deitel
1     Harvey    Deitel
2       Paul    Deitel
3       Paul    Deitel
4  Alexander      Wald